  <===========描述==========>
  MP2610是1或2个电池的单片电池，带有内置功率MOSFET的电池。采用电流模式控制，实现快速回路响应和简单补偿，达到2A充电电流。
  电荷电流可以通过感应电流通过一个精确的感应电阻来编程。
  MP2610通过两个控制回路调节充电电流和充电器电压，实现高精度的CC电荷和CV充电。
  故障状态保护包括循环-循环电流限制和热关闭。
  其他安全功能包括电池温度监测、充电状态指示和可编程计时器停止充电周期

<===========特性==========>
1/2-电池锂电池包
宽5V到24V操作输入范围
高达2A可编程充电电流
•VBATT精度±0.75%
0.2内功率MOSFET开关
高达90%的效率
•固定1.1兆赫频率
全耗尽电池的预调
•充电操作指标
输入电源和电池故障指示器
•热关机
循环循环电流保护
电池温度监视器和保护
<===========应用==========>
•分布式电力系统
单电池或双电池锂电池充电器
•智能手机
•便携式DVD播放器

绝对最大额定参数(1)
电源电压VIN .......................................26 v
甚短波VSW........................................ -0.3 v VIN + 0.3 v
VBST ......................................................甚短波+ 6 v
VCSP、VBATT ................................... -0.3 v + 18 v
所有其他别针.................................. -0.3 v + 6 v
连续功率耗散(TA=+25 c)(2)
.............................................................2.7 w
结温............................... 150°C
导致温度.................................... 260°C
储存温度...............-65°C + 150°C
推荐的操作条件(3)
电源电压VIN ..............................5 v至24 v
操作Junct.Temp ........(TJ)-20°C + 125°C
热阻(4)加jc
4毫米×4毫米QFN16 .................46 ....... 10…°C / W
注:
1)超过这些等级可能会损坏设备。
2)最大允许的功率耗散是一个函数
最大结温度TJ(最大值)，连接-环境热阻，和环境温度塔。最大允许持续功率耗散
任何环境温度都是由PD(MAX)=(TJ(MAX)-
TA)/θJA。超过最大允许的功率耗散
会导致过度的死亡温度，而调节器会消失
成热关机。内部热关闭电路
保护设备不受永久损坏。
3)设备不能保证在其工作条件之外运行。
4)在JESD51-7 4层的板上测量。

ELECTRICAL CHARACTERISTICS
VIN = 19V, TA = +25°C, CELLS=0V, unless otherwise noted.

自动充电
在电池充电电流低于终止阀值的1分钟后，充电器将停止充电，CHGOK销会变成一个开。如果由于某种原因，电池电压降至4.0/电池，充电将自动启动.
